---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitType
source: html/b8fb9226-6548-d3f1-5c4a-b70c1ecb875f.htm
---
# ConduitType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.